TestCase1D/1DVLE/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver         incompressibleVoFTC;

startFrom     /*startTime;//*/  latestTime;

startTime       0;

stopAt      /*writeNow;//*/endTime;

endTime         3;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   0.01;


purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.1;

maxAlphaCo      1;

maxDeltaT       1;

DebugSwitches
{
    MULES           1;
}

// ************************************************************************* //
