TestCase1D/1DVLE/constant/thermophysicalTransport.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    Dm       /* 0;//*/9e-6;   //  molecular Diffusions constant [m^2/s]
   //    Prt     1;      //  turbulent Prandtl number
   //    Let             1;      //  turbulent Lewis number
// ************************************************************************* //
