TestCase1D/1DVLE/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (1 0 0);

boundaryField
{
    // Wände

    rechts
    {
    type  cyclic;

    }   
    links
    {
    type  cyclic;
    }

    top
    {
        type        zeroGradient;
    }
    bottom
    {
        type        zeroGradient;
    }

    // 2D-Rand (z-Richtung)
    front
    {
        type        empty;
    }
    back
    {
        type        empty;
    }
}    



// ************************************************************************* //
