TestCase1D/1DVLE/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 1e5;

boundaryField
{
	//	Wände
	rechts
    {
       type            cyclic;
    }
   
    links
    {
        type            cyclic;
    }
   
    top
    {
        type            calculated;
        value           $internalField;
    }
    bottom
    {
        type            calculated;
        value           $internalField;
    }

    // 2D-Rand (z-Richtung)
    front
    {
        type        empty;
    }
    back
    {
        type        empty;
    }
}




// ************************************************************************* //
