TestCase1D/1DVLE/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 1e5;

boundaryField
{
	//	Wände

	
	rechts
    {
       type            prghCyclicPressure;
        patchType       cyclic;
        rhoInf          1;
    }
   
    links
    {
        type            prghCyclicPressure;
        patchType       cyclic;
        rhoInf          1;
    }

   
    top
    {
        type            prghTotalPressure;
        p0              $internalField;
    }
    bottom
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    // 2D-Rand (z-Richtung)
    front
    {
        type        empty;
    }
    back
    {
        type        empty;
    }
}





// ************************************************************************* //
