TestCase1D/1DVLE/0/Toluol.gas.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Toluol.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;


boundaryField
{
    links
    {
        type            cyclic;
        //value           uniform 1;

    }
    rechts
    {	 type cyclic;
 //       type            inletOutlet;
   //     inletValue      uniform 0.3;
     //   value           uniform 0.3;

    }
    top
    {
        type            zeroGradient;

    }
    bottom
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
