TestCase1D/1DVLE/0/alpha.liquid.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    // Wände
    rechts
    {
      type  cyclic;  // rauslassen
    }

    links
    {
     type  cyclic;
     //value uniform 1;   // Gas rein
    }

    top
    {
        type        zeroGradient;
    }
    bottom
    {
        type        zeroGradient;
    }

    // 2D-Rand (z-Richtung)
    front
    {
        type        empty;
    }
    back
    {
        type        empty;
    }
}




// ************************************************************************* //


