TestCase1D/1DVLE/system/topoSetDict

/*--------------------------------*- C++ -*----------------------------------*\
| Select central strip (x=0–1 cm, y=2–3 cm, ganze Tiefe) and make cellZone | 
\*---------------------------------------------------------------------------*/   
 
FoamFile 
{ 
	version 	2.0; 
	format 		ascii; 
	class 		dictionary; 
	location 	"system"; 
	object 		topoSetDict; 
} 

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

   



actions

(
    {
        name    mitteSet;            // Hilfs-CellSet
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            
            box (0    0.019 0) (0.015 0.021 0.001);  
        }
    }
    {
        name    mitteZone;           // eigentliche CellZone
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo { set mitteSet; }
    }
);   
